<script setup lang="ts"></script>

<template>
  <h2 class="text-xl font-bold">Задание 2</h2>

  <div class="w-150">
    <h3 class="text-lg font-semi">Подготовка</h3>

    1. Устанавливаем менеджер инструментов: winget install jdx.mise <br />
    2. Устанавливаем инструменты: mise install <br />
    3. Устанавливаем пакеты: go mod tidy <br />
    4. Запустить бекенд: mise run dev <br /><br />


    <h3 class="text-lg font-semi">Задание</h3>

    1. Стек: vxe-table + TanstackQuery <br />
    2. Отобразить в таблице строки данных из ручки /v1/users, задействовав стек<br />
    3. Добавить первый столбец с кнопкой удаления который<br />
    откроет модалку Удалить строку №X? Да Нет<br />
    4. Вызывать апи на удаление не требуется<br />
    Вывести тост, что такая-то запись удалена<br />
    Можно использовать primevue для вывода тостов или любой другой
    <br /><br />
    К кнопке, стилям и модалке требований нет. Модалку можно свою, можно primevue
  </div>
</template>
